УТ_для_edt/src/Catalogs/CRM_ЖурналыВстреч/CRM_ЖурналыВстреч.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ЖурналыВстреч</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыСогласованияПланированияВстреч</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_СтатусыСогласованияПланированияВстреч/CRM_СтатусыСогласованияПланированияВстреч.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыСогласованияПланированияВстреч</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ВидыВзаимодействий/CRM_ВидыВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВидыВзаимодействий</name>
  <comment>АПК:1034 не проверять на орфографию справку</comment>
  <predefined>
    <items>
      <name>Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>ВыезднаяВстречаИнтерес</name>
      <description>Выездная встреча интерес</description>
    </items>
    <items>
      <name>ВыезднаяВстречаПартнер</name>
      <description>Выездная встреча партнер</description>
    </items>
    <items>
      <name>ЛичнаяЗадача</name>
      <description>Задача</description>
    </items>
    <items>
      <name>ОбзвонКлиентов</name>
      <description>Обзвон клиентов</description>
    </items>
    <items>
      <name>ПотеряОбращения</name>
      <description>Потеря обращения</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьАвтоматическиПриПереходеВСосотояние</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьВЖурналеВстреч</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВстречиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныЧекЛистаВзаимодействий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЛогинНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Взаимодействия</name>
    <comment>Взаимодействия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ВладелецБизнеса</name>
    <comment>Владелец бизнеса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Противник</name>
    <comment>Противник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Прочее</name>
    <comment>Прочее</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Спонсор</name>
    <comment>Спонсор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Сторонник</name>
    <comment>Сторонник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТелефонНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторБитрикс</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартАктивностьНаСайте</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ЖурналыВстреч/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПланировщикПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	CRM_СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуТекущегоЭлементаПланировщика(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоРуководитель = ложь;
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = НачалоНедели(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Подготовка;
	КонецЕсли;
	
	ИспользоватьБизнесПроцессы = Константы.CRM_ИспользоватьБизнесПроцессы.Получить();
	СпособПоиска = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_ЖурналВстречь.СпособПоиска", "СправочникПартнеры", 1);
	ТекущийПользователь = Объект.Ответственный;
	ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.Встреча;
	//Элементы.ДеревоИтогов.Видимость = ЭтоРуководитель;
	Элементы.ГруппаПартнерыКонтакты.Видимость = НЕ ЭтоРуководитель;
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ЗагрузитьНастройкиКалендаря();
	ЗаполнитьКалендарь();
	
	КонтактыОтборПоКлиенту					= Контакты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонтактыОтборПоКлиенту.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Владелец");
	КонтактыОтборПоКлиенту.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	КонтактыОтборПоКлиенту.Использование	= Истина;
	КонтактыОтборПоКлиенту.ПравоеЗначение	= Справочники.Партнеры.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НовыйЭлемент Тогда
		Партнер = Элементы.СписокКлиентов.ТекущаяСтрока;
		Контакт = Элементы.Контакты.ТекущаяСтрока;
		СтруктураКонтактов = ПолучитьОписаниеКонтактовДляВзаимодействия(Партнер, Контакт);
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ВидВзаимодействия",		ВидВзаимодействия);
		
		
		ЗначенияЗаполнения.Вставить("Дата",						Элемент.ВыделенныеЭлементы[0].Начало);
		ЗначенияЗаполнения.Вставить("ПлановаяДата",				ОкруглитьЗначениеДаты(Элемент.ВыделенныеЭлементы[0].Начало));
		ЗначенияЗаполнения.Вставить("ПлановаяДатаЗавершение",	СдвинутьЗначениеДаты(ОкруглитьЗначениеДаты(Элемент.ВыделенныеЭлементы[0].Конец)));
		ЗначенияЗаполнения.Вставить("Тема",						Элемент.ВыделенныеЭлементы[0].Текст);
		ЗначенияЗаполнения.Вставить("Ответственный",			Объект.Ответственный);
		ЗначенияЗаполнения.Вставить("ДокументОснование",		Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("Партнер",		СтруктураКонтактов.Партнер);
		ЗначенияЗаполнения.Вставить("КонтактноеЛицо",		СтруктураКонтактов.Контакт);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
		
		ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыОткрытия, Элемент,,,, Новый ОписаниеОповещения("ПослеЗакрытияОкнаВзаимодействия", ЭтотОбъект));
		
	Иначе
		
		ОткрытьФормуТекущегоЭлементаПланировщика(Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	Если НовыйЭлемент Тогда
		
				
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Дата",						Элемент.ВыделенныеЭлементы[0].Начало);
		ЗначенияЗаполнения.Вставить("ПлановаяДата",				ОкруглитьЗначениеДаты(Элемент.ВыделенныеЭлементы[0].Начало));
		ЗначенияЗаполнения.Вставить("ПлановаяДатаЗавершение",	СдвинутьЗначениеДаты(ОкруглитьЗначениеДаты(Элемент.ВыделенныеЭлементы[0].Конец)));
		ЗначенияЗаполнения.Вставить("Тема",						Элемент.ВыделенныеЭлементы[0].Текст);
		ЗначенияЗаполнения.Вставить("Ответственный",			Объект.Ответственный);
		
		ПараметрыМероприятия = СоздатьНовоеМероприятие(ЗначенияЗаполнения);
		
			
		Элемент.ВыделенныеЭлементы[0].Значение = ПараметрыМероприятия.Ссылка;
		Элемент.ВыделенныеЭлементы[0].Текст = ПараметрыМероприятия.Текст;
		
		
	Иначе
		ОбрабатываемыеЭлементы = Новый Массив;
		
		Для Каждого ВыделенныйЭлемент Из Элемент.ВыделенныеЭлементы Цикл
			Если НЕ (ВыделенныйЭлемент.Значение = Неопределено) Тогда
				ОбрабатываемыйЭлемент = Новый Структура;
				ОбрабатываемыйЭлемент.Вставить("Источник",			ВыделенныйЭлемент.Значение);
				ОбрабатываемыйЭлемент.Вставить("ПериодНачало",		ВыделенныйЭлемент.Начало);
				ОбрабатываемыйЭлемент.Вставить("ПериодОкончание",	ВыделенныйЭлемент.Конец);
				
				ОбрабатываемыеЭлементы.Добавить(ОбрабатываемыйЭлемент);
			КонецЕсли;
		КонецЦикла;
		
		ОтменаРедактирования = Не СохранитьИзмененияВБазу(ОбрабатываемыеЭлементы);
		
	КонецЕсли;
	ЗаполнитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СпособыПоиска = Новый СписокЗначений;
	СпособыПоиска.Добавить(0, НСтр("ru = 'По началу строки'"));
	СпособыПоиска.Добавить(1, НСтр("ru = 'По части строки'"));
	СпособыПоиска.Добавить(2, НСтр("ru = 'По точному совпадению'"));
	
	НайденныйЭлемент = СпособыПоиска.НайтиПоЗначению(СпособПоиска);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Пометка = Истина;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СтрокаПоискаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	ПоказатьВыборИзМеню(ОповещениеЗавершения, СпособыПоиска, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособПоиска <> ВыбранныйЭлемент.Значение Тогда
		СпособПоиска = ВыбранныйЭлемент.Значение;
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_ЖурналВстречь.СпособПоиска","СправочникПартнеры", СпособПоиска);
		ВыполнитьПоиск(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ВыполнитьПоиск(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Партнеры") Тогда
			Партнер = ПараметрыПеретаскивания.Значение[0];
			Контакт = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Партнер, "CRM_ОсновноеКонтактноеЛицо");
			СтруктураКонтактов = ПолучитьОписаниеКонтактовДляВзаимодействия(Партнер, Контакт);
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("ВидВзаимодействия",		ВидВзаимодействия);
			
			
			ЗначенияЗаполнения.Вставить("Дата",						Дата);
			ЗначенияЗаполнения.Вставить("ПлановаяДата",				ОкруглитьЗначениеДаты(Дата));
			ЗначенияЗаполнения.Вставить("ПлановаяДатаЗавершение",	СдвинутьЗначениеДаты(ОкруглитьЗначениеДаты(Дата+1800)));
			ЗначенияЗаполнения.Вставить("Тема",						"Встреча с "+Строка(Партнер));
			ЗначенияЗаполнения.Вставить("Ответственный",			Объект.Ответственный);
			ЗначенияЗаполнения.Вставить("ДокументОснование",		Объект.Ссылка);
			ЗначенияЗаполнения.Вставить("Партнер",		СтруктураКонтактов.Партнер);
			ЗначенияЗаполнения.Вставить("КонтактноеЛицо",		СтруктураКонтактов.Контакт);
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
			
			ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыОткрытия, Элемент,,,, Новый ОписаниеОповещения("ПослеЗакрытияОкнаВзаимодействия", ЭтотОбъект));
		ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Контакт = ПараметрыПеретаскивания.Значение[0];
			Партнер = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Контакт, "Владелец");
			СтруктураКонтактов = ПолучитьОписаниеКонтактовДляВзаимодействия(Партнер, Контакт);
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("ВидВзаимодействия",		ВидВзаимодействия);
			
			
			ЗначенияЗаполнения.Вставить("Дата",						Дата);
			ЗначенияЗаполнения.Вставить("ПлановаяДата",				ОкруглитьЗначениеДаты(Дата));
			ЗначенияЗаполнения.Вставить("ПлановаяДатаЗавершение",	СдвинутьЗначениеДаты(ОкруглитьЗначениеДаты(Дата+1800)));
			ЗначенияЗаполнения.Вставить("Тема",						"Встреча с "+Строка(Партнер));
			ЗначенияЗаполнения.Вставить("Ответственный",			Объект.Ответственный);
			ЗначенияЗаполнения.Вставить("ДокументОснование",		Объект.Ссылка);
			ЗначенияЗаполнения.Вставить("Партнер",		СтруктураКонтактов.Партнер);
			ЗначенияЗаполнения.Вставить("КонтактноеЛицо",		СтруктураКонтактов.Контакт);
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
			
			ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыОткрытия, Элемент,,,, Новый ОписаниеОповещения("ПослеЗакрытияОкнаВзаимодействия", ЭтотОбъект));
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Партнер = Элементы.СписокКлиентов.ТекущаяСтрока;
	Контакт = Элементы.Контакты.ТекущаяСтрока;
	
	СтруктураКонтактов = ПолучитьОписаниеКонтактовДляВзаимодействия(Партнер, Контакт);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидВзаимодействия",		ВидВзаимодействия);
	
	
	ЗначенияЗаполнения.Вставить("Дата",						Начало);
	ЗначенияЗаполнения.Вставить("ПлановаяДата",				ОкруглитьЗначениеДаты(Начало));
	ЗначенияЗаполнения.Вставить("ПлановаяДатаЗавершение",	СдвинутьЗначениеДаты(ОкруглитьЗначениеДаты(Конец)));
	ЗначенияЗаполнения.Вставить("Тема",						"Встреча с "+Строка(Партнер));
	ЗначенияЗаполнения.Вставить("Ответственный",			Объект.Ответственный);
	ЗначенияЗаполнения.Вставить("ДокументОснование",		Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Партнер",		СтруктураКонтактов.Партнер);
	ЗначенияЗаполнения.Вставить("КонтактноеЛицо",		СтруктураКонтактов.Контакт);

	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
	
	ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыОткрытия, Элемент,,,, Новый ОписаниеОповещения("ПослеЗакрытияОкнаВзаимодействия", ЭтотОбъект));
	

КонецПроцедуры

&НаКлиенте
Процедура ПериодВперед(Команда)
	Объект.ДатаНачала = КонецНедели(Объект.ДатаНачала) + 1;
	ПослеСменыПериода();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНазад(Команда)
	Объект.ДатаНачала = НачалоНедели(Объект.ДатаНачала-1);
	ПослеСменыПериода();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПослеСменыПериода()
	ЗагрузитьНастройкиКалендаря();
	ЗаполнитьКалендарь();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиПериода(НачалоПериода, КонецПериода)
	Заголовок = "Журнал встреч/" + Объект.Ответственный.Наименование + "/" + НеделяГода(НачалоПериода) + " неделя (" + ПредставлениеПериода(НачалоПериода, КонецПериода)+")";
	Элементы.ДекорацияПериод.Заголовок =  ПредставлениеПериода(НачалоПериода, КонецПериода);
	НовоеНаименование = Объект.Ответственный.Наименование + "/" + НеделяГода(НачалоПериода) + " неделя (" + ПредставлениеПериода(НачалоПериода, КонецПериода)+")";
	Если Объект.Наименование <> НовоеНаименование Тогда
		Объект.Наименование = НовоеНаименование;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеКонтактовДляВзаимодействия(Партнер, Контакт)
	СтруктвраВозврата = Новый Структура("Партнер, Контакт", Партнер, Контакт);
	Если Партнер = Неопределено Тогда
		СтруктвраВозврата.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
		СтруктвраВозврата.Вставить("Контакт", Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
	КонецЕсли;	
	Если Контакт = Неопределено Тогда
		СтруктвраВозврата.Вставить("Контакт", Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
	КонецЕсли;
	Если Партнер.ЭтоГруппа Тогда
		СтруктвраВозврата.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
		СтруктвраВозврата.Вставить("Контакт", Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
	КонецЕсли;
	
	Если НЕ СтруктвраВозврата.Партнер.Пустая() И СтруктвраВозврата.Контакт.Пустая() Тогда
		СтруктвраВозврата.Вставить("Контакт", Партнер.CRM_ОсновноеКонтактноеЛицо);
	КонецЕсли;	
	Возврат СтруктвраВозврата;	
КонецФункции	

&НаКлиенте
Процедура ПослеЗакрытияОкнаВзаимодействия(Результат, ДопПараметры) Экспорт
	ЗаполнитьКалендарь();
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СохранитьИзмененияВБазу(ОбрабатываемыеЭлементы)
	
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого ОбрабатываемыйЭлемент Из ОбрабатываемыеЭлементы Цикл
			
			ЗаписьОбъект = ОбрабатываемыйЭлемент.Источник.ПолучитьОбъект();
			
			Если ОбрабатываемыйЭлемент.Свойство("ПометкаУдаления") Тогда
				ЗаписьОбъект.УстановитьПометкуУдаления(ОбрабатываемыйЭлемент.ПометкаУдаления);
				Продолжить;
			КонецЕсли;
			
			ЗаписьОбъект.ПлановаяДата = ОбрабатываемыйЭлемент.ПериодНачало;
			ЗаписьОбъект.ПлановаяДатаЗавершение = ОбрабатываемыйЭлемент.ПериодОкончание;
			ЗаписьОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Успешно = Ложь;
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось сохранить изменения в календаре по причине: %1';en='Could not save changes to calendar due to: %1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
	Если Элементы.СписокКлиентов.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если Элементы.СписокКлиентов.ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда 
		ПартнерОтбора = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	Иначе	
		ПартнерОтбора = Элементы.СписокКлиентов.ТекущаяСтрока;
	КонецЕсли;	
	
	КонтактыОтборПоКлиенту					= Контакты.Отбор.Элементы[0];
	КонтактыОтборПоКлиенту.ПравоеЗначение	= ПартнерОтбора;
	Элементы.Контакты.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(ОповещатьОбОшибках)
	
	ОбрабатыватьАктивизациюПоиска = Истина;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	// Проверка возможности поиска.
	Отказ = Ложь;
	ТекстСообщения = НСтр("ru='Минимальная длина строки поиска 3 символа.';en='Minimum length of the search line is 3 characters.'");
	Если ОповещатьОбОшибках И СтрДлина(СтрокаПоиска) < 3  И СтрДлина(СтрокаПоиска) > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СтрокаПоиска",, Отказ);
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПоискНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере(УсловияПоиска = Неопределено)
	
	Если УсловияПоиска = Неопределено Тогда
		
		// Анализ строк поиска, формализация условий и заполнение кэша.
		КэшПоиска = CRM_КлиентыСервер.СтруктураДанныхКэша();
		КэшЗаполнения = CRM_КлиентыСервер.СтруктураДанныхКэша();
		УсловияПоиска = Новый Массив;
		Если Не ПустаяСтрока(СтрокаПоиска) Тогда
			СтрокаПоискаНормализованная = CRM_КлиентыСервер.НормализоватьСтрокуПоискаИДополнитьКэш(СтрокаПоиска, КэшПоиска, КэшЗаполнения);
			УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
		КонецЕсли;
		
	КонецЕсли;
	
	// Поиск.
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКлиентов, "Ссылка", Новый СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.СписокКлиентов.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		Возврат;
	КонецЕсли;	
	Элементы.СписокКлиентов.Отображение = ОтображениеТаблицы.Список;
	УстановитьПривилегированныйРежим(Истина);
	РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, СпособПоиска, Истина);
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКлиентов, "Ссылка", Новый СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 200, 200);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Партнеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпСсылки
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В(&Массивссылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактныеЛицаПартнеров.Владелец
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Ссылка В(&Массивссылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	тмпСсылки.Ссылка КАК Ссылка
	|ИЗ
	|	тмпСсылки КАК тмпСсылки";
	Запрос.УстановитьПараметр("Массивссылок", РезультатПоиска.Элементы);
	СписоСсылокДляОтбора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКлиентов, "Ссылка", СписоСсылокДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Если СписоСсылокДляОтбора.Количество() = 0 Тогда
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 200, 200);
	Иначе
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 255, 255);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТекущегоЭлементаПланировщика(Элемент)
	
	ЗначениеЭлемента = Элемент.ВыделенныеЭлементы[0].Значение;
	
	Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ЗначениеЭлемента);
		ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
		
		ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыОткрытия, Элемент,,,, Новый ОписаниеОповещения("ПослеЗакрытияОкнаВзаимодействия", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиКалендаря()
	СтруктураНастройкиОтображения = ПолучитьНастройкиОтображенияПоУмолчанию();
	
	СохраненныеНастройки = CRM_ХранилищеНастроек.Загрузить("Обработка_CRM_Календарь_Настройки", "СтруктураНастроек");
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		Если СохраненныеНастройки.Свойство("НастройкиОтображения") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураНастройкиОтображения.НастройкиОтображения, СохраненныеНастройки.НастройкиОтображения);
		КонецЕсли;
		
		Если СохраненныеНастройки.Свойство("ОбщиеНастройки") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураНастройкиОтображения.ОбщиеНастройки, СохраненныеНастройки.ОбщиеНастройки);
		КонецЕсли;
	КонецЕсли;
	
	// Настройки пользователя
	НастройкиРабочееВремяПользователя = CRM_ОбщегоНазначенияСервер.ПолучитьСтруктуруРабочихВременПользователя(ТекущийПользователь);
	Если ЗначениеЗаполнено(НастройкиРабочееВремяПользователя.ВремяНачалаРабочегоДня) Тогда
		СтруктураНастройкиОтображения.НастройкиОтображения.НачалоРабочегоДняЧас = Час(НастройкиРабочееВремяПользователя.ВремяНачалаРабочегоДня);
	Иначе
		СтруктураНастройкиОтображения.НастройкиОтображения.НачалоРабочегоДняЧас = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиРабочееВремяПользователя.ВремяОкончанияРабочегоДня) Тогда
		СтруктураНастройкиОтображения.НастройкиОтображения.КонецРабочегоДняЧас = Час(НастройкиРабочееВремяПользователя.ВремяОкончанияРабочегоДня);
	Иначе
		СтруктураНастройкиОтображения.НастройкиОтображения.КонецРабочегоДняЧас = 23;
	КонецЕсли;
	
	СтруктураНастройкиОтображения.НастройкиОтображения.ПоказыватьНедействительныхПользователей = (CRM_ХранилищеНастроек.Загрузить("ПоказыватьНедействительныхПользователей") = Истина);
	ПоказыватьНедействительныхПользователей = СтруктураНастройкиОтображения.НастройкиОтображения.ПоказыватьНедействительныхПользователей;
	
	Если ЗначениеЗаполнено(НастройкиРабочееВремяПользователя.ВремяНачалаОбеденногоПерерыва) И ЗначениеЗаполнено(НастройкиРабочееВремяПользователя.ВремяОкончанияОбеденногоПерерыва) Тогда
		СтруктураНастройкиОтображения.НастройкиОтображения.ЕстьОбеденныйПерерыв = Истина;
		СтруктураНастройкиОтображения.НастройкиОтображения.НачалоОбеденногоПерерываЧас = Час(НастройкиРабочееВремяПользователя.ВремяНачалаОбеденногоПерерыва);
		СтруктураНастройкиОтображения.НастройкиОтображения.КонецОбеденногоПерерываЧас = Час(НастройкиРабочееВремяПользователя.ВремяОкончанияОбеденногоПерерыва);
	Иначе
		СтруктураНастройкиОтображения.НастройкиОтображения.ЕстьОбеденныйПерерыв = Ложь;
		СтруктураНастройкиОтображения.НастройкиОтображения.НачалоОбеденногоПерерываЧас = 0;
		СтруктураНастройкиОтображения.НастройкиОтображения.КонецОбеденногоПерерываЧас = 23;
	КонецЕсли;
	
	КэшНастроекОтображения = СтруктураНастройкиОтображения;
	
	РасписаниеИнтервалШкалыВремени = ?(КэшНастроекОтображения.НастройкиОтображения.РасписаниеИнтервалШкалыВремени < 30, 30, КэшНастроекОтображения.НастройкиОтображения.РасписаниеИнтервалШкалыВремени);
	
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 24;
	Планировщик.ОтступСНачалаПереносаШкалыВремени = КэшНастроекОтображения.НастройкиОтображения.НачалоДняКалендаряЧас;
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 24 - КэшНастроекОтображения.НастройкиОтображения.КонецДняКалендаряЧас;
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='dddd, d MMMM yyyy'";
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	НачалоПериода = НачалоНедели(Объект.ДатаНачала);
	Если  КэшНастроекОтображения.НастройкиОтображения.КалендарьКоличествоДнейВНеделе = 5 Тогда
		КонецПериода  = КонецНедели(Объект.ДатаНачала) - 2 * 24 * 60 * 60;
	Иначе	
		КонецПериода  = КонецНедели(Объект.ДатаНачала);
	КонецЕсли;	

	ТаблицаПериодов = СформироватьТаблицуПериодов(НачалоПериода, КонецПериода);
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	Для Каждого СтрокаПериодаДат Из ТаблицаПериодов Цикл
		Для Каждого ТекПериодОтображения Из СтрокаПериодаДат.ТаблицаПериодов Цикл
			Если ТекПериодОтображения.Обед Тогда
				НовыйИнтервалФора = Планировщик.ИнтервалыФона.Добавить(ТекПериодОтображения.НачалоПериода, ТекПериодОтображения.ОкончаниеПриода);
				//НовыйИнтервалФора.Метки.Добавить("Обед","Обед");
				НовыйИнтервалФора.Цвет = Новый Цвет(241, 241, 241);
			ИначеЕсли ТекПериодОтображения.НеРабочееВремя Тогда
				НовыйИнтервалФора = Планировщик.ИнтервалыФона.Добавить(ТекПериодОтображения.НачалоПериода, ТекПериодОтображения.ОкончаниеПриода);
				НовыйИнтервалФора.Цвет = Новый Цвет(241, 241, 241);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьЗаголовкиПериода(НачалоПериода, КонецПериода);
	
		
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуПериодов(ДатаНачала, ДатаОкончания)
	
	КоличествоДней					= ((ДатаОкончания - ДатаНачала)+1)/86400;
	КалендарьКоличествоДнейВНеделе	= КэшНастроекОтображения.НастройкиОтображения.КалендарьКоличествоДнейВНеделе;
	
	МассивДат = Новый Массив;
	
	ТекДата = ДатаНачала;
	Для Ном = 1 По КоличествоДней Цикл
		МассивДат.Добавить(ТекДата);
		
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
	График = CRM_ОбщегоНазначенияСервер.ПолучитьОсновнойПроизводственныйКалендарь();
	
	Попытка
		МассивДатРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(График, МассивДат, Ложь);
	Исключение
		МассивДатРабочихДней = Новый Соответствие;
		Для каждого ТекДень Из МассивДат Цикл
			МассивДатРабочихДней.Вставить(ТекДень, ТекДень);
		КонецЦикла;
		Ошибка = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сред(Ошибка, СтрНайти(Ошибка, "}:")+2));
	КонецПопытки;
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("Дата");
	ТаблицаДат.Колонки.Добавить("Рабочий");
	ТаблицаДат.Колонки.Добавить("ДеньНедели");
	ТаблицаДат.Колонки.Добавить("ТаблицаПериодов");
	ТаблицаВыбранныхДат = Новый ТаблицаЗначений;
	Для Каждого СоответствиеДат Из МассивДатРабочихДней Цикл
		
		Если ТаблицаВыбранныхДат.Количество() > 0 Тогда
			МассивСтрок = ТаблицаВыбранныхДат.НайтиСтроки(Новый Структура("Дата",СоответствиеДат.Ключ));
			Если МассивСтрок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ДеньНедели(СоответствиеДат.Ключ) > КалендарьКоличествоДнейВНеделе Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДат.Добавить();
		НоваяСтрока.Дата		= СоответствиеДат.Ключ;
		НоваяСтрока.Рабочий		= (СоответствиеДат.Ключ = СоответствиеДат.Значение);
		НоваяСтрока.ДеньНедели	= ДеньНедели(НоваяСтрока.Дата);
	КонецЦикла;
	
	ТаблицаДат.Сортировать("Дата");
	
	Для Каждого СтрокаДаты Из ТаблицаДат Цикл
		СтрокаДаты.ТаблицаПериодов = ВренутьПериодыПоДате(СтрокаДаты.Дата);
	КонецЦикла;
	
	Возврат ТаблицаДат;
	
КонецФункции

&НаСервере
Функция ВренутьПериодыПоДате(ДатаДня)
	
	НачалоДняКалендаряЧас					= КэшНастроекОтображения.НастройкиОтображения.НачалоДняКалендаряЧас;
	КонецДняКалендаряЧас					= КэшНастроекОтображения.НастройкиОтображения.КонецДняКалендаряЧас;
	НачалоРабочегоДняЧас					= КэшНастроекОтображения.НастройкиОтображения.НачалоРабочегоДняЧас;
	КонецРабочегоДняЧас						= КэшНастроекОтображения.НастройкиОтображения.КонецРабочегоДняЧас;
	РасписаниеИнтервалШкалыВремени			= ?(КэшНастроекОтображения.НастройкиОтображения.РасписаниеИнтервалШкалыВремени < 30, 30, КэшНастроекОтображения.НастройкиОтображения.РасписаниеИнтервалШкалыВремени);
	ИспользоватьСобытияНаВесьДень			= КэшНастроекОтображения.НастройкиОтображения.ИспользоватьСобытияНаВесьДень;
	ЕстьОбеденныйПерерыв					= КэшНастроекОтображения.НастройкиОтображения.ЕстьОбеденныйПерерыв;
	НачалоОбеденногоПерерываЧас				= КэшНастроекОтображения.НастройкиОтображения.НачалоОбеденногоПерерываЧас;
	КонецОбеденногоПерерываЧас				= КэшНастроекОтображения.НастройкиОтображения.КонецОбеденногоПерерываЧас;
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("НачалоПериода");
	ТаблицаПериодов.Колонки.Добавить("ОкончаниеПриода");
	ТаблицаПериодов.Колонки.Добавить("НеРабочееВремя");
	ТаблицаПериодов.Колонки.Добавить("Обед");
	
	Для Ном = 0 По 23 Цикл
		
		Если Ном >= НачалоДняКалендаряЧас И Ном <= КонецДняКалендаряЧас Тогда
			ТекДата		= ДатаДня+(3600*Ном);
			
			СтрокаЧаса = ТаблицаПериодов.Добавить();
			СтрокаЧаса.НачалоПериода	= ТекДата;
			СтрокаЧаса.ОкончаниеПриода	= ТекДата+3599;
			
			Если ЕстьОбеденныйПерерыв Тогда
				Если Ном >= НачалоОбеденногоПерерываЧас И Ном < КонецОбеденногоПерерываЧас Тогда
					СтрокаЧаса.НеРабочееВремя = Истина;
					СтрокаЧаса.Обед = Истина;
				Иначе
					СтрокаЧаса.НеРабочееВремя = Ложь;
					СтрокаЧаса.Обед = Ложь;
				КонецЕсли;
			Иначе
				СтрокаЧаса.Обед = Ложь;
				СтрокаЧаса.НеРабочееВремя = Ложь;
			КонецЕсли;
			
			Если Ном < НачалоРабочегоДняЧас ИЛИ Ном >= КонецРабочегоДняЧас Тогда
				СтрокаЧаса.НеРабочееВремя = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПериодов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКалендарь()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Взаимодействие.ПлановаяДата КАК ПлановаяДата,
	|	CRM_Взаимодействие.ПлановаяДатаЗавершение КАК ПлановаяДатаЗавершение,
	|	CRM_Взаимодействие.Содержание КАК Содержание,
	|	CRM_Взаимодействие.Ссылка КАК Ссылка,
	|	CRM_Взаимодействие.Ответственный КАК Ответственный,
	|	CRM_Взаимодействие.Тема КАК Тема,
	|	CRM_Взаимодействие.СтатусВзаимодействия КАК СтатусВзаимодействия
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	ТабСобытий = Запрос.Выполнить().Выгрузить();
	СтрокаРодитель = ДеревоИтогов.ПолучитьЭлементы().Добавить();
	СтрокаРодитель.Показатель = Объект.Ответственный.Наименование;
	СтрокаВид = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	СтрокаВид.Показатель = "Встреча с клиентом";
	Планировщик.Элементы.Очистить();
	Для Каждого СтрокаСобытие Из ТабСобытий Цикл
		НовыйЭлемент  = Планировщик.Элементы.Добавить(СтрокаСобытие.ПлановаяДата, СтрокаСобытие.ПлановаяДатаЗавершение);
		НовыйЭлемент.Текст    = ПолучитьПредставлениеСобытия(СтрокаСобытие.Тема, Неопределено, СтрокаСобытие.Ответственный, СтрокаСобытие.ПлановаяДата, СтрокаСобытие.ПлановаяДатаЗавершение);;
		НовыйЭлемент.Значение = СтрокаСобытие.Ссылка;
		СтрокаВид.План = СтрокаВид.План + 1;
		Если СтрокаСобытие.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
			СтрокаВид.Факт = СтрокаВид.Факт + 1;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиОтображенияПоУмолчанию()
	СтруктураНастройки = Новый Структура();
	
	// Примечание: не все настройки в структуре выносятся на редактирование пользователю,
	// некоторые существуют с целью хранить все в одном месте.
	
	// Настройки отображения
	СтруктураНастройкиОтображения = Новый Структура(
	"НачалоДняКалендаряЧас,
	|КонецДняКалендаряЧас,
	|НачалоРабочегоДняЧас,
	|КонецРабочегоДняЧас,
	|ПоказыватьНедействительныхПользователей,
	|КалендарьКоличествоДнейВНеделе,
	|СписокПредставлениеСобытияВКалендаре,
	|РасписаниеИнтервалШкалыВремени,
	|ИспользоватьСобытияНаВесьДень,
	|ЕстьОбеденныйПерерыв,
	|НачалоОбеденногоПерерываЧас,
	|КонецОбеденногоПерерываЧас,
	|РасположениеШкалыВремени,
	|ОтображатьЦветомЗагруженностьКалендаря");
	
	СтруктураНастройкиОтображения.РасположениеШкалыВремени = 0;
	СтруктураНастройкиОтображения.ОтображатьЦветомЗагруженностьКалендаря = Ложь;
	
	СтруктураНастройкиОтображения.НачалоДняКалендаряЧас	= 8;
	СтруктураНастройкиОтображения.КонецДняКалендаряЧас	= 19;
	
	СтруктураНастройкиОтображения.НачалоРабочегоДняЧас	= 0;
	СтруктураНастройкиОтображения.КонецРабочегоДняЧас	= 23;
	
	СтруктураНастройкиОтображения.ПоказыватьНедействительныхПользователей = Ложь;
	
	СтруктураНастройкиОтображения.ЕстьОбеденныйПерерыв	= Ложь;
	СтруктураНастройкиОтображения.НачалоОбеденногоПерерываЧас	= 0;
	СтруктураНастройкиОтображения.КонецОбеденногоПерерываЧас	= 0;
	
	СтруктураНастройкиОтображения.КалендарьКоличествоДнейВНеделе = 7;
	
	СписокПредставлениеСобытияВКалендаре = Новый СписокЗначений();
	СписокПредставлениеСобытияВКалендаре.Добавить("Тема", НСтр("ru='Тема';en='Subject'"), Истина);
	СписокПредставлениеСобытияВКалендаре.Добавить("Время", НСтр("ru='Время';en='Time'"), Истина);
	СписокПредставлениеСобытияВКалендаре.Добавить("Клиент", НСтр("ru='Клиент';en='Client'"), Ложь);
	СписокПредставлениеСобытияВКалендаре.Добавить("Пользователь", НСтр("ru='Пользователь';en='User'"), Ложь);
	
	СтруктураНастройкиОтображения.СписокПредставлениеСобытияВКалендаре = СписокПредставлениеСобытияВКалендаре;
	
	СтруктураНастройкиОтображения.РасписаниеИнтервалШкалыВремени = 30;
	СтруктураНастройкиОтображения.ИспользоватьСобытияНаВесьДень = Истина;
	
	СтруктураНастройки.Вставить("НастройкиОтображения", СтруктураНастройкиОтображения);
	
	// Общие настройки
	СтруктураОбщиеНастройки = Новый Структура(
	"КалендарьИспользоватьКалендарныеГрафики,
	|ОтображатьПолеСодержанияКалендаря,
	|КалендарьОбновлятьПриЛюбыхСобытиях,
	|Автообновление,
	|ПериодАвтообновления");
	
	СтруктураОбщиеНастройки.ОтображатьПолеСодержанияКалендаря = Истина;
	
	СтруктураОбщиеНастройки.КалендарьИспользоватьКалендарныеГрафики = Истина;
	СтруктураОбщиеНастройки.КалендарьОбновлятьПриЛюбыхСобытиях 		= Ложь;
	
	СтруктураОбщиеНастройки.Автообновление = Ложь;
	СтруктураОбщиеНастройки.ПериодАвтообновления = 1;
	
	СтруктураНастройки.Вставить("ОбщиеНастройки", СтруктураОбщиеНастройки);
	
	Возврат СтруктураНастройки;
КонецФункции

&НаСервере
Функция СоздатьНовоеМероприятие(ЗначенияЗаполнения)
	
	НовоеМероприятие = Документы.CRM_Взаимодействие.СоздатьДокумент();
	НовоеМероприятие.Заполнить(ЗначенияЗаполнения);
	НовоеМероприятие.ВидВзаимодействия = ВидВзаимодействия;
	НовоеМероприятие.Баллы = НовоеМероприятие.ВидВзаимодействия.Баллы;
	НовоеМероприятие.ДокументОснование = Объект.Ссылка;
	НовоеМероприятие.Записать();
	
	// Формирование оповещений+
	//ТаблицаНастроекОповещений = Новый ТаблицаЗначений;
	//ТаблицаНастроекОповещений.Колонки.Добавить("Канал", Новый ОписаниеТипов("ПеречислениеСсылка.CRM_КаналыОповещений"));
	//ТаблицаНастроекОповещений.Колонки.Добавить("СрокОповещения", Новый ОписаниеТипов("Число"));
	//ТаблицаНастроекОповещений.Колонки.Добавить("Периодичность", Новый ОписаниеТипов("ПеречислениеСсылка.CRM_ПериодичностьОповещений"));
	//ТаблицаНастроекОповещений.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	//ТаблицаНастроекОповещений.Колонки.Добавить("ДатаОповещения", Новый ОписаниеТипов("Дата"));
	//
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИспользоватьНапоминания", Константы.CRM_ИспользоватьНапоминания.Получить());
	//ДополнительныеПараметры.Вставить("ИспользоватьОповещенияСМС", Константы.CRM_ИспользоватьОповещенияСМС.Получить());
	//ДополнительныеПараметры.Вставить("ИспользоватьОповещенияЭлектроннаяПочта", Константы.CRM_ИспользоватьОповещенияЭлектроннаяПочта.Получить());
	//ДополнительныеПараметры.Вставить("ПлановаяДата", НовоеМероприятие.ПлановаяДата);
	//ДополнительныеПараметры.Вставить("Ответственный", НовоеМероприятие.Ответственный);
	//CRM_ОповещенияСервер.ЗаполнитьТаблицуОповещений(НовоеМероприятие.Ссылка,
	//												ТаблицаНастроекОповещений,
	//												ТекущийПользователь,
	//												Истина,
	//												ДополнительныеПараметры);
	
	//СтруктураИзменений = Новый Структура;
	//СтруктураИзменений.Вставить("Новое",				Истина);
	//СтруктураИзменений.Вставить("ИзмененаДата",			Ложь);
	//СтруктураИзменений.Вставить("ИзмененоМесто",		Ложь);
	//СтруктураИзменений.Вставить("ИзмененСостав",		Ложь);
	//
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("ТаблицаНастроекОповещений",					ТаблицаНастроекОповещений);
	//СтруктураДанных.Вставить("ОтменаИлиЗавершениеВзаимодействия",			Ложь);
	//СтруктураДанных.Вставить("НовыеУчастники",								Новый СписокЗначений);
	//СтруктураДанных.Вставить("УдаленныеУчастники",							Новый СписокЗначений);
	//СтруктураДанных.Вставить("ЭтоНовоеСобытие",								Истина);
	//СтруктураДанных.Вставить("ИзмененСоставУчастников",						Ложь);
	//СтруктураДанных.Вставить("ПризнакПериодическоеСобытиеИнициализация",	Ложь);
	//СтруктураДанных.Вставить("Пользователь",								ТекущийПользователь);
	//СтруктураДанных.Вставить("Состояние",									Неопределено);
	//АдресНастроек = ПоместитьВоВременноеХранилище(СтруктураДанных, УникальныйИдентификатор);
	//
	//CRM_ОповещенияСервер.СформироватьОповещенияПоСобытию(НовоеМероприятие.Ссылка, АдресНастроек);
	// Формирование оповещений-
	
	СтруктураВозврата = Новый Структура("Ссылка,Текст,ЦветФона");
	СтруктураВозврата.Ссылка			= НовоеМероприятие.Ссылка;
	СтруктураВозврата.Текст				= ПолучитьПредставлениеСобытия(НовоеМероприятие.Тема, Неопределено, НовоеМероприятие.Ответственный, НовоеМероприятие.ПлановаяДата, НовоеМероприятие.ПлановаяДатаЗавершение);
	Если ЗначениеЗаполнено(НовоеМероприятие.ОсновнаяКатегория) Тогда
	СтруктураВозврата.ЦветФона			= Новый Структура("ЦветКрасный,ЦветЗеленый,ЦветСиний",НовоеМероприятие.ОсновнаяКатегория.ЦветКрасный,
										  НовоеМероприятие.ОсновнаяКатегория.ЦветЗеленый,
										  НовоеМероприятие.ОсновнаяКатегория.ЦветСиний);
	Иначе
		СтруктураВозврата.ЦветФона = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеСобытия(Тема = "", Партнер, Пользователь, ПериодНачало, ПериодОкончание, ВесьДень = Ложь)
	
	СписокПредставлениеСобытияВКалендаре = КэшНастроекОтображения.НастройкиОтображения.СписокПредставлениеСобытияВКалендаре;
	
	
	Если ВесьДень Тогда
		ПредставлениеПериод = "";
	Иначе
		ПредставлениеПериод = Формат(ПериодНачало, "ДФ=ЧЧ:мм") + " - " + Формат(ПериодОкончание, "ДФ=ЧЧ:мм");
	КонецЕсли;
	
	бЗаголовок = Истина;
	СтрТекущая = "";
	СтрЗаголовок = "";
	СтрОбластьСобытия = "";
	бСкобка = Истина;
	Для Каждого СтрСписка Из СписокПредставлениеСобытияВКалендаре Цикл
		Если Не СтрСписка.Пометка Тогда Продолжить; КонецЕсли;
		
		// Если СтрСписка.Значение = "Время" И ОбъектИмеетСвойство(ОписаниеСобытия, "СобытиеНаВесьДень") И
		// ОписаниеСобытия.СобытиеНаВесьДень Тогда
		//	Продолжить;
		// КонецЕсли;
		
		СтрТекущая = ?(бЗаголовок, СтрЗаголовок, СтрОбластьСобытия);
		
		Если СтрСписка.Значение = "Время" Тогда
			Если Не ПустаяСтрока(ПредставлениеПериод) Тогда
				Если Не бСкобка Тогда
					СтрТекущая = СтрТекущая + ") ";
					бСкобка = Истина;
				ИначеЕсли Не ПустаяСтрока(СтрТекущая) Тогда
					СтрТекущая = СтрТекущая + " ";
				КонецЕсли;
				СтрТекущая = СтрТекущая + ПредставлениеПериод;
			КонецЕсли;
		ИначеЕсли СтрСписка.Значение = "Тема" Тогда
			Если Не ПустаяСтрока(Тема) Тогда
				Если Не ПустаяСтрока(СтрТекущая) Тогда
					Если Не бСкобка Тогда
						СтрТекущая = СтрТекущая + ") ";
						бСкобка = Истина;
					ИначеЕсли Не ПустаяСтрока(СтрТекущая) Тогда
						СтрТекущая = СтрТекущая + " ";
					КонецЕсли;
				КонецЕсли;
				СтрТекущая = СтрТекущая + Тема;
			КонецЕсли;
		ИначеЕсли СтрСписка.Значение = "Клиент" Тогда
			Если ЗначениеЗаполнено(Партнер) Тогда
				Если Не ПустаяСтрока(СтрТекущая) Тогда
					Если Не бСкобка Тогда
						СтрТекущая = СтрТекущая + ") ";
						бСкобка = Истина;
					ИначеЕсли Не ПустаяСтрока(СтрТекущая) Тогда
						СтрТекущая = СтрТекущая + ", ";
					КонецЕсли;
				КонецЕсли;
				СтрТекущая = СтрТекущая + Строка(Партнер);
			КонецЕсли;
		ИначеЕсли СтрСписка.Значение = "Пользователь" Тогда
			Если ЗначениеЗаполнено(Пользователь) Тогда
				Если Не ПустаяСтрока(СтрТекущая) Тогда
					Если Не бСкобка Тогда
						СтрТекущая = СтрТекущая + ") ";
						бСкобка = Истина;
					ИначеЕсли Не ПустаяСтрока(СтрТекущая) Тогда
						СтрТекущая = СтрТекущая + ", ";
					КонецЕсли;
				КонецЕсли;
				СтрТекущая = СтрТекущая + Строка(Пользователь);
			КонецЕсли;
		КонецЕсли;
		
		Если бЗаголовок Тогда
			СтрЗаголовок = СтрТекущая;
		Иначе
			СтрОбластьСобытия = СтрТекущая;
		КонецЕсли;
		
		Если бЗаголовок Тогда
			Если Не бСкобка Тогда СтрЗаголовок = СтрЗаголовок + ")"; КонецЕсли;
			бЗаголовок = Ложь;
			бСкобка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не бСкобка И Не ПустаяСтрока(СтрТекущая) Тогда
		СтрТекущая = СтрТекущая + ")";
		Если бЗаголовок Тогда
			СтрЗаголовок = СтрТекущая;
		Иначе
			СтрОбластьСобытия = СтрТекущая;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаголовок) Тогда
		Возврат СтрОбластьСобытия;
	ИначеЕсли ПустаяСтрока(СтрОбластьСобытия) Тогда
		Возврат СтрЗаголовок;
	Иначе
		Возврат СтрЗаголовок + " " + СтрОбластьСобытия;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СдвинутьЗначениеДаты(ОкончанияПериода)
		
	Если ОкончанияПериода = НачалоДня(ОкончанияПериода) Тогда
		ОкончанияПериода = ОкончанияПериода - 1;
	КонецЕсли;
	
	Возврат ОкончанияПериода;

КонецФункции

&НаКлиенте
Функция ОкруглитьЗначениеДаты(ЗначениеДаты)
	
	Если Планировщик.ШкалаВремени.Элементы.Количество() > 1
		И Планировщик.ШкалаВремени.Элементы[1].Единица = ТипЕдиницыШкалыВремени.Минута Тогда
		
		ОкруглятьДо = Планировщик.ШкалаВремени.Элементы[1].Кратность / 2;
		
		ЗначениеДаты = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(ЗначениеДаты, ОкруглятьДо, Истина);
		
	КонецЕсли;
	
	Возврат ЗначениеДаты;
	
КонецФункции

#КонецОбласти


#Область ПроцедурыИФункцииБизнеспроцессов

// +ПанельБП
&НаСервереБезКонтекста
Функция ПроверитьДубликатБизнесПроцесса(Предмет)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_БизнесПроцесс.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	|ГДЕ
	|	НЕ CRM_БизнесПроцесс.ПометкаУдаления
	|	И НЕ CRM_БизнесПроцесс.Завершен
	|	И CRM_БизнесПроцесс.Предмет = &Предмет");
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Функция ВернутьЗаголовокКоманды(ИмяКоманды)
	
	Возврат Команды[ИмяКоманды].Заголовок;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОснованияБизнесПроцесса(Знач ИмяКоманды = Неопределено)
	СтруктураРезультат = Новый Структура("Основание,КартаМаршрута,ИспользоватьВИнтересах", Объект.Ссылка, Неопределено, Неопределено);
	
	Если ИмяКоманды <> Неопределено Тогда
		Если Найти(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_") > 0 Тогда
			ИдентификаторСсылки = Новый УникальныйИдентификатор(СтрЗаменить(СтрЗаменить(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_", ""), "_", "-"));
			ТочкаМаршрутаСсылка = Справочники.CRM_ТочкиМаршрутов.ПолучитьСсылку(ИдентификаторСсылки);
			Если ЗначениеЗаполнено(ТочкаМаршрутаСсылка) Тогда
				СтруктураРезультат.Вставить("ТочкаСтарта", ТочкаМаршрутаСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцесс(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		ТекстВопроса = НСтр("ru='Данные еще не записаны."
"Выполнение действия ""Начать '") + ВернутьЗаголовокКоманды(Команда.Имя) + """ " + НСтр("ru='возможно только после записи данных."
"Данные будут записаны.'");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_КомандаНачатьБизнесПроцессПродолжение", ЭтотОбъект, Команда.Имя);	
		ПоказатьВопрос(, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Подключаемый_КомандаНачатьБизнесПроцессПродолжение(Неопределено, Команда.Имя)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцессПродолжение(Ответ, КомандаИмя) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		Если Ответ <> КодВозвратаДиалога.ОК Тогда 
			Возврат;
		КонецЕсли;	
		
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПроверитьДубликатБизнесПроцесса(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru='Уже создан бизнес-процесс."
"Создать новый?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_КомандаНачатьБизнесПроцессЗавершение", ЭтотОбъект, КомандаИмя);	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Неопределено, КомандаИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Ответ, КомандаИмя) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	СтруктураОснования = ПолучитьСтруктуруОснованияБизнесПроцесса(КомандаИмя);
	ПараметрыФормы = Новый Структура("Основание",СтруктураОснования);
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.ФормаОбъекта",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуГиперссылок()
	
	ТекстКоманда = Команды.Найти("_ВыполнитьЗадачу");
	Если ТекстКоманда = Неопределено Тогда
		НоваяКомандаФормы = Команды.Добавить("_ВыполнитьЗадачу");
		НоваяКомандаФормы.Заголовок					= "Выполнить";
		НоваяКомандаФормы.Подсказка					= "Отметить задачу как выполненную";
		НоваяКомандаФормы.Действие					= "Подключаемый_ВыполнитьЗадачу";
		//НоваяКомандаФормы.ИзменяетСохраняемыеДанные	= Истина;
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов = Новый Массив();
	
	Попытка
		ЭтотОбъект["_ЛичнаяЗадача"] = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		ЭтотОбъект["_ЛичнаяЗадачаСтрокой"] = "";
	Исключение
		ОписаниеТиповЗадача = Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя");
		НовыйРеквизит = Новый РеквизитФормы("_ЛичнаяЗадача", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		ОписаниеТиповЗадача = Новый ОписаниеТипов("Строка");
		НовыйРеквизит = Новый РеквизитФормы("_ЛичнаяЗадачаСтрокой", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецПопытки;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	0 КАК ВидСсылки
	|ПОМЕСТИТЬ ЛичныеЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	(НЕ ЗадачаИсполнителя.ПометкаУдаления)
	|	И ЗадачаИсполнителя.CRM_Личная
	|	И (НЕ ЗадачаИсполнителя.Выполнена)
	|	И ЗадачаИсполнителя.Предмет = &Предмет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ЛичныеЗадачи.Ссылка,
	|	ЛичныеЗадачи.ВидСсылки
	|ИЗ
	|	ЛичныеЗадачи КАК ЛичныеЗадачи";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаб Из ТаблицаОбъектов Цикл
		Если СтрокаТаб.ВидСсылки = 0 Тогда
			ЭтотОбъект._ЛичнаяЗадача			= СтрокаТаб.Ссылка;
			ЭтотОбъект._ЛичнаяЗадачаСтрокой	= Строка(СтрокаТаб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Отрисуем гиперссылки
	// Гирепссылка на Задачу
	Если НЕ Элементы.Найти("_ЛичнаяЗадачаСтрокой") = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаЗаголовок"]);
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаСтрокой"]);
			Элементы.Удалить(Элементы["Кнопка_ВыполнитьЗадачу"]);
		КонецЕсли;
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			
			НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаЗаголовок", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗаголовок);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= "Задача: ";
			
			НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаСтрокой", Тип("ДекорацияФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.Заголовок	= СокрЛП(ЭтотОбъект._ЛичнаяЗадача);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Гиперссылка= Истина;
			НовыйЭлемент.УстановитьДействие("Нажатие",	"Подключаемый_ГиперссылкаНажатие");
			
			НовыйЭлемент = Элементы.Добавить("Кнопка_ВыполнитьЗадачу",Тип("КнопкаФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.ИмяКоманды			= "_ВыполнитьЗадачу";
			НовыйЭлемент.Заголовок			= "Выполнить";
			НовыйЭлемент.Картинка			= БиблиотекаКартинок.ВыполнитьЗадачу;
			НовыйЭлемент.Отображение		= ОтображениеКнопки.КартинкаИТекст;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") ИЛИ ТипЗнч(НовыйОбъект) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		ЗаполнитьГруппуГиперссылок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ЗагрузитьНастройкиКалендаря();
	ЗаполнитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия = CRM_РабочийСтолСервер.ПолучитьПараметрыОткрытияФормы("Обработка.CRM_АРМПланированияВстреч.Форма.ФормаАРМ", ПараметрыОткрытия);
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыОткрытия.Вставить("Ключ", Объект.Ссылка);
	КонецЕсли;	
	ОткрытьФорму("Обработка.CRM_АРМПланированияВстреч.Форма.ФормаАРМ", ПараметрыОткрытия);
	Отказ = Истина;
КонецПроцедуры
// -ПанельБП

#КонецОбласти
